
pinlei_file_config_dic={
    '网络电影':['导演', '编剧', '主演', '演员', '主演饰', '演员饰', '单集时长',
                   '影片简介', '项目亮点','项目介绍', '影片精华看点','标签', '豆瓣ID',
                   '联系人姓名','电话', '邮箱','联系人地址','出品方', '联合出品方', '发行方', '制片方','税率3'],
    '纪录片':['制作团队', '履历说明', '导演', '嘉宾', '集数', '单集时长','影片简介', '项目亮点',
                   '项目方案','电视播出平台','介质清晰度',
                   '联系人姓名','电话', '邮箱','联系人地址', '出品方', '联合出品方', '发行方', '制片方','税率3'],
    '纪录片方案':['制作团队', '履历说明', '导演', '嘉宾', '集数', '单集时长','影片简介', '项目亮点',
                   '项目方案','电话', '邮箱',],
    '网络剧':['导演', '编剧', '主演', '演员', '主演饰', '演员饰','集数', '单集时长',
                   '影片简介', '项目亮点','项目介绍',
                   '电话', '邮箱','联系人姓名','联系人地址','出品方', '联合出品方', '发行方', '制片方'],
    '微短剧':['导演', '编剧', '主演', '演员', '主演饰', '演员饰','制作团队文本','集数', '单集时长',
                   '影片简介', '项目亮点','项目介绍','电视播出平台',
                   '联系人姓名','电话', '邮箱','联系人地址', '出品方', '联合出品方', '发行方', '制片方','税率3'],
    '少儿':['导演', '编剧', '主演', '制片人','演员', '主演饰', '演员饰','集数', '单集时长',
                   '内容类型',  '影片简介', '项目亮点','项目介绍','电视播出平台','介质清晰度',
                   '联系人姓名','电话', '邮箱','联系人地址', '出品方', '联合出品方', '发行方', '制片方','税率3'],
    '动漫':['导演', '编剧', '主演', '制片人','演员', '主演饰', '演员饰','集数', '单集时长',
                   '制作类型','是否完结' ,'影片简介', '项目亮点','项目介绍',
                   '联系人姓名','电话', '邮箱','联系人地址', '出品方', '联合出品方', '发行方', '制片方','税率3'],
    '综艺':['导演', '制片人','常驻嘉宾','嘉宾','制作团队文本','履历说明','集数', '单集时长',
                   '题材类型','影片简介', '项目亮点','项目介绍','电视播出平台',
                   '联系人姓名','电话', '邮箱','联系人地址', '出品方', '联合出品方', '发行方', '制片方','税率3'],
    '知识付费':['合作周期3年','内容类型视频','是否完结','集数', '单集时长','主讲人','知识付费简介','项目亮点',
            '制作团队文本','联系人姓名','电话', '邮箱','联系人地址', ]
}
pinlei_config = {
    # project_leixing 项目类型，1成片，2方案
    # shouquan  授权性质：1独播，2非独播
    '网络电影':{'project_leixing':1,
            'shouquan':1,
            'ip':1,
            'beiAn':1,
            'FuFei':1},
    '纪录片':{'project_leixing':1,# 纪录片 无IP字段
            'ip':3,
            'beiAn':1,
            'shouquan':1,},
    '纪录片方案':{'project_leixing':2,
             'ip':3,
            'shouquan':1 },#纪录片方案，无授权性质，默认是1
    '少儿':{'project_leixing':1,#
            'ip':1,
            'shouquan':1,
            'beiAn':2,
            'FuFei':3},
    '少儿方案':{'project_leixing':2,
            'shouquan':1 },#纪录片方案，无授权性质，默认是1
    '微短剧':{'project_leixing':1,
            'shouquan':1,
            'ip':1,
            'beiAn':1},
    '动漫':{'project_leixing':1,
            'shouquan':2,
            'ip':1,
            'beiAn':2},
    '知识付费':{'project_leixing':1,
            'shouquan':2,
            'ip':3,
            'beiAn':14,# 知识付费备案状态是：11-15
            'FuFei':4},# 包月选1  单点选4
    # 网络剧备案状态4/5/6/7/8/9
    '网络剧':{'project_leixing':1,
            'shouquan':1,
            'ip':1,
            'beiAn':8},
    '综艺':{'project_leixing':1,
            'shouquan':1,
            'ip':3,
            'beiAn':10},# 综艺备案状态，只能是 10：规划备案、规划备案号
    '网络剧方案':{'project_leixing':2,
            'shouquan':2,
            'ip':1,
             'beiAn':1},
}


